---
layout: 	post
title:		"神经网络与深度学习"
subtitle:	"——训练和问题"
header-img:	"img/post-bg-deeplearning.jpg"
date:		2016-04-01
author: 	"Borg"
catalog:	true
tags:
    - 神经网络
    - 深度学习
    - 翻译
---
# 训练和问题
在技术书籍中，作者劝告读者一定要做书中的训练和问题是很常见的。当我读到这样的告诫时，我总会觉得很奇怪。如果我不做训练和问题，难道会有不好的事情发生吗？当然不会。我会有更多的时间，但这样就无法深刻地理解书本。有时，这样做是值得的。有时则不是。  
那么在这本书中有哪些训练和问题是值得做的呢？我建议你去尝试完成书中大部分的训练，而对于问题就不要全做。  
训练用来检验你是否理解基础知识，因此你应该完成大部分的训练。如果你不能解决相对容易的训练题，那么你可能错过了一些很基础的知识。当然，如果你只是偶尔被一道训练题难住，那就继续往下读。也许你只是误解了题目，又或者是我的措辞不当。但如果你觉得大部分训练都很困难，那么你可能需要回头重新阅读材料。  
问题则不同于训练。它们比训练难，你可能很难解决一些训练题。这很烦人，但是只有保持耐心去面对这些问题才能真正理解内化相应知识。  
所以说，我不建议做完所有的问题。要是你自己找问题解决更好。比如，你可能想用神经网络来对你的音乐收藏进行分类，或者预测股票价格等等。但是要找自己感兴趣的项目。然后你就可以忽略书中的问题，或者只是把它们当作你自己项目的启发。解决一个自己感兴趣的问题所能学到的，远比解决任何数量的其它问题还多。兴趣是掌握知识技能的关键。  
当然，你可能还没想到这样的项目，至少目前没有。那也没关系。只要完成书中你觉得想完成的问题就行。然后用书中的材料来帮你找到自己感兴趣的项目。  

---
本书由Borg翻译自[Michael A. Nielsen, "Neural Networks and
Deep Learning", Determination Press, 2015](http://neuralnetworksanddeeplearning.com/about.html)，引用请注明出处。  
本书受[署名-非商业性使用 3.0 Unported](http://creativecommons.org/licenses/by-nc/3.0/legalcode)证书保护，可自由复制、分享和演绎，但不得用于商业用途。![证书](http://i.creativecommons.org/l/by-nc/3.0/88x31.png)
